# IdeaStatiCa.ConnectionApi.Model.IdeaParameterValidation

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**ValidationExpression** | **string** |  | [optional]
**ValidationExpressionEvaluated** | **bool** |  | [optional]
**LowerBound** | **string** |  | [optional]
**LowerBoundEvaluated** | **double** |  | [optional]
**UpperBound** | **string** |  | [optional]
**UpperBoundEvaluated** | **double** |  | [optional]
**ValidationStatus** | **string** |  | [optional]
**Message** | **string** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)